app/views/patients/statistics.html.erb

SELECT COUNT(*) AS "count_all", DATE(created_at) AS "date_created_at" FROM "patients" GROUP BY DATE(created_at)
---
  <script>
    document.addEventListener('DOMContentLoaded', function() {
      const rawData = <%= @patients_by_date.to_json.html_safe %>;
      const dates = Object.keys(rawData);
      const counts = Object.values(rawData);

      const maxPatients = Math.max(...counts, 1); // Ensure at least 1
      const yMax = maxPatients + 1;

      const ctx = document.getElementById('patientChart').getContext('2d');
      new Chart(ctx, {
        type: 'bar',
        data: {
          labels: dates,
          datasets: [{
            label: 'Patients Registered',
            data: counts,
            backgroundColor: '#4e73df',
            borderColor: '#4e73df',
            borderWidth: 1
          }]
        },