app/controllers/patients_controller.rb

  def create
    @patient = Patient.new(patient_params)

    respond_to do |format|
      if @patient.save
---
INSERT INTO "patients" ("name", "gender", "age", "phone", "bill", "created_at", "updated_at", "symptom", "dob", "allergies", "blood_type") VALUES ('Yadu Pratap', 'male', 21, '987654321', 100, '2025-03-08 17:49:28.471078', '2025-03-08 17:49:28.471078', 'Cough', '2004-10-15', 'Nut allergy', 'AB-') RETURNING "id"

  def update
    respond_to do |format|
      if @patient.update(patient_params)
---
UPDATE "patients" SET "updated_at" = '2025-03-08 17:48:18.590831', "symptom" = 'Skin redness', "allergies" = 'Lactose intolerant' WHERE "patients"."id" = 2

  def destroy
    @patient.destroy!
---
DELETE FROM "patients" WHERE "patients"."id" = 1

  def statistics
    @patients_by_date = Patient.group("DATE(created_at)").count
---
SELECT COUNT(*) AS "count_all", DATE(created_at) AS "date_created_at" FROM "patients" GROUP BY DATE(created_at)

    def set_patient
      @patient = Patient.find(params.expect(:id))
---
SELECT "patients".* FROM "patients" WHERE "patients"."id" = NULL LIMIT 1